# Pandas Data Engineering

### Python for Data Engineering

## How do I select rows by index?

In [36]:
ti.loc[ [0, 3, 5], 'sex'] # row indexes, column names

0      male
3    female
5      male
Name: sex, dtype: object

## How do I select rows by position?

In [37]:
table = [
    [1, "male", 19],
    [1, "female", 22],
]

In [41]:
table[-1][-1]

22

In [43]:
ti.iloc[0:2, 0:2] # columns have to be by-position!

   survived     sex
0         0    male
1         1  female

## How do I create new columns?

In [44]:
ti['new_column'] = ti['sex'].str.upper()

In [46]:
ti['new_column'].sample()

725    MALE
Name: new_column, dtype: object

## How do I create a column using a conditional business rule?

In [64]:
import numpy as np
np.select([ True, False], ["YES", "NO" ])

array('YES', dtype='<U21')

In [55]:
import numpy as np

conditions =  [raw['sex'] == 'male', raw['sex'] != 'male']
options    =  [raw['age'], raw['fare']]

raw['measure'] = np.select(conditions, options)
raw['measure'].sample()

## How do I group and aggregate data?

```
df['column-to-be-aggregated'].groupby(
    df['values-to-split-on']
).summaryfn()
```

* `SELECT age FROM df GROUP BY survived`
* `SELECT age FROM df GROUP BY survived, class`
* `SELECT age FROM df WHERE age <= 18 GROUP BY survived, class`

What is the average age of the Titanic passengers?

In [31]:
df['fare'].groupby(df['survived']).mean()

survived
0    22.117887
1    48.395408
Name: fare, dtype: float64

In [30]:
df['age'].groupby(df['survived']).count()

survived
0    424
1    290
Name: age, dtype: int64

```
df['column-to-be-aggregated'].groupby(
    df['values-to-split-on']
).aggregationfn()
```

* `SELECT age FROM df GROUP BY survived`
* `SELECT age FROM df GROUP BY survived, class`
* `SELECT age FROM df WHERE age <= 18 GROUP BY survived, class`

## How I groupby multiple columns?

In [32]:
df['fare'].groupby([df['survived'], df['class']]).mean()

survived  class
0         First     64.684008
          Second    19.412328
          Third     13.669364
1         First     95.608029
          Second    22.055700
          Third     13.694887
Name: fare, dtype: float64

```
df['column-to-be-aggregated'].groupby(
    df['values-to-split-on']
).aggregationfn()
```

* `SELECT age FROM df GROUP BY survived`
* `SELECT age FROM df GROUP BY survived, class`
* `SELECT age FROM df WHERE age <= 18 GROUP BY survived, class`

## How do I create new factor/group columns?

## How do I derive new groups from numerical columns?

## How do I derive a text column?

## How do I import data from an excel file?

In [ ]:
import pandas as pd

raw = pd.read_excel('titanic.xlsx')

## How do I select different excel sheets?

In [63]:
sheet1 = pd.read_excel('titanic.xlsx',  sheet_name=0)

## How do I rename columns?

In [13]:
ti = raw.rename(columns={
    'survived': 'P_Survival',
    'age': 'X_Age',
    'sex': 'X_Sex'
})

## How do I remove columns?

In [21]:
selected = ['P_Survival', 'X_Age', 'X_Sex']

ti = ti[selected]
ti.sample()

     P_Survival  X_Age X_Sex
850           0    4.0  male

In [22]:
raw.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [23]:
ti = raw.drop(columns=['pclass', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'])

In [24]:
ti

     survived     sex   age
0           0    male  22.0
1           1  female  38.0
2           1  female  26.0
3           1  female  35.0
4           0    male  35.0
..        ...     ...   ...
886         0    male  27.0
887         1  female  19.0
888         0  female   NaN
889         1    male  26.0
890         0    male  32.0

[891 rows x 3 columns]

## How do I change the type of a column?

In [27]:
ti['y'] = ti['survived'].astype(bool)

In [28]:
ti['y'].sample()

771    False
Name: y, dtype: bool

In [32]:
ti['sex_cat'] = ti['sex'] == "male"

ti['sex_cat'].sample()

623    True
Name: sex_cat, dtype: bool

## How do I join datasets?

* `pd.concat`
    * gluing at the end using index position
* `df.join`
* `df.merge`
    * sql-like
    * joining columns togther
    * based on column which overlaps

In [8]:
import pandas as pd

ti = pd.read_excel('titanic.xlsx')
tips = pd.read_csv('tips.csv')

In [34]:
ti_sample = ti[['sex', 'survived']].head(len(tips))

In [35]:
ti_sample.shape

(244, 2)

In [36]:
tips['sex'] = tips['sex'].str.lower()

tips_sample = tips[['sex', 'total_bill']]

tips_sample.shape

(244, 2)

In [37]:
eg = ti_sample.merge(tips_sample, on='sex')

eg.sample()

        sex  survived  total_bill
18233  male         0        9.55

In [44]:
ti_sample.merge(tips_sample)

          sex  survived  total_bill
0        male         0       10.34
1        male         0       21.01
2        male         0       23.68
3        male         0       25.29
4        male         0        8.77
...       ...       ...         ...
32423  female         1       10.09
32424  female         1       22.12
32425  female         1       35.83
32426  female         1       27.18
32427  female         1       18.78

[32428 rows x 3 columns]

## Appendix

In [5]:
import seaborn as sns
sns.load_dataset('titanic').to_excel('titanic.xlsx', index=False)

In [6]:
sns.load_dataset('tips').to_csv('tips.csv', index=False)